Autodesk.Revit.DB.Structure.AnalyticalToPhysicalAssociationManager.SetAssociationsChanged(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId})
This method is called when the associations between Analytical and Physical Elements have changed.
doc:
Revit document.
ids:
The ids of the elements that changed association.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2023